openfoam-bridge/templates/cold-periodic-cascade-2d/0/U
FoamFile {version 2.0; format ascii; class volVectorField; object U;}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (18 0 0);
boundaryField { cyclicLow {type cyclic;} cyclicHigh {type cyclic;} spanLow {type empty;} spanHigh {type empty;} inlet {type pressureInletOutletVelocity; value uniform (18 0 0);} outlet {type inletOutlet; inletValue uniform (18 0 0); value uniform (18 0 0);} blade {type noSlip;} }
