openfoam-bridge/templates/cold-periodic-cascade-2d/0/k
FoamFile {version 2.0; format ascii; class volScalarField; object k;}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.5;
boundaryField { cyclicLow {type cyclic;} cyclicHigh {type cyclic;} spanLow {type empty;} spanHigh {type empty;} inlet {type fixedValue; value uniform 0.5;} outlet {type inletOutlet; inletValue uniform 0.5; value uniform 0.5;} blade {type kqRWallFunction; value uniform 0.5;} }
