openfoam-bridge/templates/cold-periodic-cascade-2d/system/fvSolution
FoamFile {version 2.0; format ascii; class dictionary; object fvSolution;}

solvers {
 p {solver GAMG; tolerance 1e-9; relTol 0; maxIter 100; smoother GaussSeidel;}
 "(U|h|k|omega)" {solver smoothSolver; smoother symGaussSeidel; tolerance 1e-10; relTol 0;}
 rho {solver diagonal;}
}
SIMPLE {nNonOrthogonalCorrectors 2; consistent no;
 residualControl {p 1e-5; U 1e-5; h 1e-5; k 1e-5; omega 1e-5;}}
relaxationFactors {fields {p 0.15; rho 0.15;} equations {U 0.3; h 0.5; k 0.5; omega 0.5;}}
